["I always keep a track of which games are going on at the moment as I am a Football enthusiast and I love to gain as much knowledge as possible about Football so that I can talk to my friends and family about it. Not just them, I also discuss these at my workplace. The screenshot only shows matches of one certain league, the Premier League but other I also follow other leagues amongst them. \r\nAs soon as I open the app, at the bottom of the screen you may see the options of Home, Games, Discover and Profile. Just a tap to the Games section and it directs me to the matches that are being held recently or in the future with the variety of choosing which competitions to follow. \r\nOnce I am onto the Games section, I look for the league that is most interesting to me such as the Premier league by scrolling up and down and when I finally reach the destination of the league, I tap onto the match that is the most interesting and easily I can view the statistics, Overview, Line-ups of teams in that match.", "On this screen I want to put together a shopping list I can use while at the store. To arrive on this specific screen you have to open the app. Then you need to create a shopping list by selecting 'Add shopping list' from the main screen menu. Multiple shopping lists can exist at the same time. To reach the screen in the picture you  must then select a shopping list. In this instance, I chose my Kroger store shopping list. On this page you can add shopping items to your list by choosing the plus. You can add also add details for each item by selecting the small i symbol. These details can include pictures and other notes.  You can cross out items you have purchased by selecting an existing item. This is helpful as you shop. You can print out the list or send the list. Sending the list is helpful because it is a shared grocery list. It is also possible to scan items by selecting the scanner symbol.", "I use this screen by reading the posts to see if there's anything interesting enough to click on. If not I scroll down looking for posts that may interest me more. I mostly use it to stay entertained during down time throughout the day, but sometimes I use it to keep up with current events even though I'd rather not. I also use it to find specific communities of like minded people to talk with. I also use it for help with things sometimes, like if I'm doing a DIY project, legal issues, cooking, or basically anything else. Above all I use it when I'm bored but there are plenty of times I've used it to get helpful information, there are many helpful people using the site. To get this specific screen I just opened the app then went to the page called \"all\" which is just all the communities listed together sorted by the most popular posts currently.", "This is the general screen on wild rift that I used to interact with the platform. It includes social functions like adding friends, typing messages to them, And finding groups to play with. I can also use the play button to get in a match and play with other players. When I’m on the screen I usually press the play button and then I get into a match where I fight in a battle arena online. This green also includes functions for redeem rewards for simply playing the game as you can see there are options to click on the wild pass rank missions and there is a store icon where you can buy endgame merchandise to improve your player experience overall. This screen also let you bring up the rankings of other players so you can compare your performance to those that are also playing the game with you . ", "The goal that I wish to achieve on the Popular posts screen on Apollo is to find interesting new content to view and possibly comment upon. To get to this screen from the app's homescreen, I select the upper left corner where the label \"Subreddits\" is present and then select the \"Popular Posts\" option near the top of the screen with the blue and white trending arrow icon. Once I am on the screen, I scroll down until I find a post that I think might be interesting. To do so, I look for visual cues such as the number of awards given to a post as well as numerical information such as the number of positive votes a post has received as well as the number of comments that are associated with the post. After viewing a post and its comments, I can swipe from the left edge of the screen to return back to the Popular Posts screen. The screen has endless scrolling enabled and so I can continue to scroll and find additional content. I do this until I am satisfied with what I have seen or if have something to attend to (e.g. the line that I have been waiting in has cleared and I put away my phone).", "I use this screen if I want to search a person's profile for a certain tweet I am looking for or maybe saw before and want to find again. I go to a person's profile then I hit the search icon to search just that person's tweets for information I need. I just scroll down the results once I get the search results from my search term. I use this screen when I need to search someone's profile specifically rather just needing to search twitter generally. This search is much more specific. I go the app if I need to do this because I do not have that functionality when I am using Twitter on my laptop. I think it is very helpful to search someone's tweets for key terms and knowing I can do that keeps me from trying to remember things or taking screenshots when I am browsing on Twitter.", "To see current relevant events going on, I go to the search tab and can sort through various topics, audio only spaces, and find profiles of other people. Also able to see trending hashtags, customized content for your account based on history. It's pretty self explanatory, and is simple to use. It can show you profiles, videos, photos, different links to sites and visit outside sites through it's built in browser extension. If you want to find everything but trending / currently relevant items, you click the search bar on top. It'll populate different current hot topics as you type words into it to help you along the way.\r\n\r\nThe plus symbol also allows you to create your own tweet and share it with your followers or general accounts if you're public. A source of inspiration for things to tweet about. It also lets you retweet and join communities of various interests. ", "This is the duo lingo home screen. Here I have access to all the core features of the app including the most important which are the lessons. In this screen shot you can see Unit 1 and some of its lessons IE Intro, Phrases, and Travel. You can also see various metrics and buttons to go to other features of the app like leader boards, stories, friends, gem store, and announcements. In the upper right you can see duo lingo pro button which allows you to see that you are subscribed or allow you to subscribe. below that is a premium feature that allows you to work on words or lessons you have made mistakes on in the past. And the bottom right circle is the current XP you have earned for the day as well as the monthly badge and how much XP you have towards completing the badge.", "My goal is to improve the quality of my sleep and make sure that I am getting enough sleep time. From the main screen on the app, I scrolled down to the symbol for sleep (a half moon and a Z) and I can see my sleep score for the previous night. I can look for more details by clicking on the symbol. I can then see details of the following: 1. how many minutes I was awake during my sleep period. 2. how many minutes of REM sleep. 3. how many minutes of light sleep and 4. how many minutes of deep sleep. It also tells me what time I went to bed and what time I got up. The app analyzes this data, along with breathing and heartbeat, to generate a sleep score for the night. To have the app do all this, I must wear it to bed. I can see my sleep scores for the week in a graph at the top and I can scroll down for previous weeks. I can think about my activities on the days when my score is better so that I can make a habit of activities that promote good sleep scores. ", "To get to this page, I unlock my phone, slide my finger up the screen to open the app tray and find the Amazon Shopping icon, I touch to open the application. I open this app to take a look at products that I might want to purchase. I look at this screen for advertisements, because sometimes they have some good deals on the front page. Once I'm done perusing the front page, I move to the search bar and enter a search term for what I'm interested in buying. I click on anything interesting, then I read the product description. If the product would be suitable for me, I go on to read some customer reviews. If all the reviews are good, I mark the page as a possible purchase. I do the same thing with other products, that also might fit my needs. When I've narrowed my selection down to the product that I want to buy, I navigate to the checkout and purchase the product.", "After logging into the Letsfit App on my phone, I can sync my smartwatch with the device to monitor my activity. The app can monitor things such as heart rate, blood oxygen levels, calories burned, steps taken, and sleep duration. I mainly use it to monitor my heart rate due to my Inappropriate Sinus Tachycardia. Once you're on the device all you have to do is wait to scroll down to Heart, which will show both your maximum heart rate as well as your resting heart rate. If you click on the heart rate tab it will show you a chart of your heart rate activity data, which consists of your daily, weekly, and monthly heart rates. This is very helpful to me because it allows me to keep track of my heart rates without having to worry about writing anything down to memorize it myself. The app is really useful for anyone who owns a Letsfit smartwatch. ", "I use this screen more than any other on Spotify. One thing I love about Spotify is that it's so easy to create and edit large playlists. I can collect and curate all my favorite music any way I want. It's like creating the perfect music box sets, but I can take them with me anywhere I go. The main goals I want to achieve on this screen are to either create a new playlist (by tapping the plus button in the top right corner), or listening to one of my existing playlists (clicking on the title of any of the playlists on the screen). If I'm creating a playlist, the first step is to name my new playlist, then pressing the \"Create\" button. From there, I press the \"Add songs\" button to add music to it. On a preexisting playlist, I would just tap on the title of the playlist and press play to listen to it. To get to the Your Library screen, I tap the Your Library button at the bottom right of the app.", "I use this screen to see the content that I am interested in and that I follow so I can view it at a later time if needed. I will go to my following section and scroll through it and when there is no more new news left I will go to discover and search the related subjects that I'm interested in. I will type in the search bar specific subjects such as government, or covid so I can see what is happing in the news for those subjects. I will also go to the local page at the top of the app and read my local news and what is happening around my city. This is where I will find pretty much all of my important news locally and globally. I will like any posts or view the comments if it is an interesting article that I felt was worth the time to read about. I like to click the comments section just to see if any people have any interesting facts or comments about the article. ", "This screen tells me the forecast for the week. This is helpful where I live as it can change pretty quick without much notice. I typically use it in the winter. It is especielly important during the coldest of nights when it reaches below zero F. Need to turn on a small heater in the basement to prevent frozen pipes.\r\nTo find this page I open the app, once opened I scroll down to the third section labeled \"daily forecast\". I then click on \"more\" to open the full screen with more information found on this page. I will then scroll left to right to find any particular day that looks to be bad weather or severely cold. Then I will read the finer details of what is to be expected that day so I can make sure I am prepared for any delays on the road to work like snow.", "This is one of most frequently used app. I use this app to order food. I use this app as I can accumulate points and redeem them on future purchase. I will use offer and deals by using this App. This app also helps to find location of the store near me. I can use this app to pay for the purchase. I can find new deals. I can find new menu. This app offers free fries on some order. I use to redeem points to buy free drink. I will take time to know what is new deals available. The app comes with code that I can use If I buy in store. This app is good to redeem points and get free drink. Some time the app offers buy one get one free burger. It also offers free fries for order on deal of the day. This is must have app for me.", "To find the daily rain or general precipitation forecast/total amount forecast, I tap on the weekly rain amount forecast on the home screen page. Then I scan the daily and/or hourly high for rain or precip to see if there's a particularly large amount of rain in the upcoming forecast for that day or week, depending on the situation. My goals in using this app are pretty simple in that I needed a better caliber of weather app to help keep track of upcoming storms, especially things like sudden rain showers or thunderstorms. My wife and I live in a 110-year-old house in an area of the United States (philadephia) that's prone to a fairly high amount of rain in the spring/summer and thus you'll have wet/flooded basements. this app helps me plan my week as far as when I travel or when to keep on eye on things like the gutters/basement.", "I use this screen to see if I have Hits available to complete. I want to be alerted that there are Hits I need to complete on my laptop. I clicked the icon for this app on my phone and this screen is the first to show. I just need to scroll on this screen to see the history of jobs that have been available. I want to use this screen to see if I should return to my computer or continue to accomplish task I may have for the day that are away from my computer. I can use this app to also check my phone from my computer but when I use it on my phone it is just letting me know if I need to check my computer as well. I can also save this information to analyze later to judge busy times of the day or when I need to focus my efforts.", "When I'm looking for new music or just sort of want a change of pace, I go to Apple Music's Radio feature. From the main menu, I click on the Radio icon that's on the bottom of the page. I scroll down until something catches my eye that looks interesting to me. I look for an artist I like, or a specific type of music that I like. Once I see something interesting, I tap on the picture and that brings up some general information about the radio \"station\". From that I can usually quickly decide if it's something I want to sample. I usually sample by clicking on the featured playlist and listen to some of the songs. I can usually tell pretty quickly if it's something I like and/or am in the mood for. What's nice about the radio feature is that it's a really quick and convenient way to find new artists and expand my range of tastes. I don't have to wade through much stuff to find out if I like it or not.", "On the Spotify app, I use this screen by selecting new music I like and listening to them. The goal I want to achieve through the screen is to find new songs to add to my playlist. The steps I took to get to the screen of the app is by selecting the search image. Once I am on the search tab page I click on the \"New Music Friday\" to see if anyone's songs are of my interest. Another goal I want to achieve through the new release section of the screen is sharing the song with my friends. I would make a new playlist and select the new songs that I think my friend will like and share with them. Another goal I want to achieve through the screen is to find songs so time can go faster instead of wasting my time doing nothing. It is a good way to use my time.", "I used the Twitter home feed to get the latest news and updates from the people I follow. I get to this screen just by opening my Twitter app. After opening it, the home feed automatically loads up. I then scroll the feed to read information. Most of the time, the feed contains ads and retweets. When there are too many retweets from one specific source, I go to that person's profile to mute their retweets. I don't want my feed to be full of retweets but I understand why some profiles will do that. They don't have enough content of their own or they feel like they have always have to be active to beat Twitter' algorithm, so they'll retweet so many things. The ads that show up on my feed are ok since I can quickly just scroll past them. When I see a tweet that is interesting, I will like and/or retweet it.", "I use this screen on the app to treat myself and find items that I might like. Basically, after everything I've done and bought on Etsy, it's curated what I like, or at least it's idea of what I like, and it suggests me stuff based off of that. Having a tab to similar items that I have viewed helps me achieve my goals of getting items I want, finding new things I might not have found, and overall it's just an easier way to have access and gain insight on cool shops and items that could be very great for me. The steps I took to achieve getting to this screen we're pretty simple, I just open the app, and when I'm on the home page it has this \"items similar to what I've viewed\" tab, which I then click on. I click on this tab, and browse through all the items, and find stuff I might like, or my spouse might like, etc. It's just a good way to treat myself and find cool things.", "The goals that I want to achieve through this screen is to check my previous payments, to see how many payments I have left(along with their amounts), and to possibly make an early payment. The way that I get to this particular page is by first opening the app, tapping on the profile icon on the bottom of the screen, tapping on \"Your Orders\", tapping on \"Filter\" and selecting \"2021\" under \"Filter by order date\" and then tapping \"Apply\". I then tap on the purchase, which is an ASUS laptop, scroll down to the \"Order info\" section and tap on \"View and manage monthly payments\". From there, I tap on the summary information for the payment plan, which then takes me to the more detailed page(the screenshot). In order to achieve my goals, I either just quickly review the previously paid amount and see what amount is still remaining to be paid or I scroll down a tad bit to tap on \"Pay early\" in order to make the next payment now instead of waiting for it to be automatically deducted from my payment method on the specified future date.", "This screen shows the menu of channels in the NFL Chat Discord server. This allows you to go to various channels (like chat rooms) devoted to various topics. To get to this screen, I tap on the server's icon on the left hand side. Then you can choose from the various channels in the server by tapping on the name of the server. Then you can talk to people on the server similar to how you would in a text messaging app with a text box at the bottom and your phone's keyboard. You can also share links, videos, or photos in the channels by using icons above the keyboard where you type. You can reply to other people's messages by quoting them using a special formatting language called markdown, or react to their messages by tapping and holding your finger on a message and waiting for the emoji menu to show up. When you've finished, you can his the enter button, and your message or reaction will be posted to the server for other members to view.  ", "This is how I analyze my games, or others' games, after they have been played. It is used to gain knowledge and see how the game could have played out in other lines/moves. From the home screen of the app, you can get here a few ways. Normally, I will go to my own games played, which requires me to open the profile page, then the games played tab, and then select a game. This will take me to the game board. From there I can find the analysis board function in a dropdown menu. Selecting that will take the game to the analysis board, allowing me to use the computer to analyze lines, to play out moves and see the best moves by computer analysis. I can also compare games I've played to others in the database from here, allowing me to see how other games will play out, to see if there are common traps or attacks that are used in certain positions by using the menu on the bottom. After moving pieces, the computer will automatically analyze them and offer move suggestions. It will also create new lines that you can save and go back to, automatically.", "I use the Deezer Shows screen to browse podcasts and find new content worth listening to. I use it to find podcasts that I have not previously listened to and would be good for me to subscribe to. In order to get to the podcasts screen I just go to the horizontal menu at the bottom that is visible when you first open the app. The Shows tab is the second option in the list, which I click to open. From there I scroll to the bottom where you can see categories of podcasts by duration as well as podcasts by network. From there I browse the different duration categories to find a podcast that fits within the timeframe that I am looking to listen to. If I can't really find anything from there that I want to listen to, I'll check for podcasts by network by opening up some network categories that I am familiar with.", "In order to know what is happening with traffic and if it is going to add a lot of time to my work commute, I use Waze. I first tap on the Waze app, then click on the 'Where to' box and click on work since I've already entered the address previously. The app will tell me approximately how long it will take with current traffic conditions. As I travel to work, it will update me on whether there is an accident, a hazard on the road, or where police have been reported so I can watch my speed. If there is an accident, I can get off the interstate and Waze will automatically adjust to the new route and tell me what route to take to make it to work. While I use it daily for work, Waze really works well when I'm traveling some place I've never been. It's comforting to know that I won't get lost and if I miss a turn, Waze will adjust and help me reach my destination.", "My goals are to track my health and wellbeing over time on this screen. I first tap the menu in the top left of the main screen, then tap on Graphs & Reports on the list to get to this screen. Once I'm on this screen, I view the cycle duration to make sure that it's on irregular and close to average. Then I click on the different icons to input information that will help me track my health and it's changes. I tap on Weight to enter my weight for the day and to view the graph to see how quickly I'm losing weight and if I need to change something in my diet to continue losing weight. When I'm feeling tired and want to keep a close record of my sleep, I tap on the Sleep Duration icon to enter my sleep cycle and check to see that I'm getting my target sleep each night or total for the week. The app tracks all the health information I need to meet these goals and shows them to me in a quick understandable way.", "My goal in the step I'm about to describe is sharing a video that I've recorded with the app.  I generally record them for business purposes.  To share a recorded video, I first find the icon on my phone's screen.  It's on the primary screen I use when working with it.  I then click the icon.  Four different icons appear, and I click the one with four squares to access my videos.  On that screen (as it appears in the uploaded screenshot), I click on the network icon which looks like a \"less than\" symbol with circles at each angle.  I'm then given several options which are quite useful.  At this point, I generally choose the email option so I can directly attach it to one via my phone.  I've never had an issue sharing a video in this way as it's been a very reliable app.", "1. On this screen (on this section of the app) I change various settings so that I can set up video recordings specifically to my liking. Usually I want to achieve getting things set up so that my video recordings are of a high enough quality that they look alright to look at, but also aren't so high that they take up a ton of data when they're saved, and won't take up a lot of processing power to record.\r\n\r\n2. In order to get to this screen I tap on the app once, after which it opens a small bubble, and a bar above from the drop down menu. I click on the \"Home\" button from the drop down menu, which opens the main app. From there I tap the \"Settings\" button below, shown by the gear symbol.\r\n\r\n3. Once on this screen, I make adjustments, such as the video's orientation, the location of the save file, the resolution, frame rate, and general size of the file, as well as other settings like whether to enable or disable shaking to stop record, and other things like adjusting a countdown timer before recording. In order to do so, I tap on any of these settings, which then opens up a new menu with several options. From there I select all the options I want, and hit a checkmark button to save all the changes I've made. I do this for each individual option section until I'm pleased with all my changes.", "Viewing this screen allows me to see a quick visual representation of how many calories I have already consumed today and how many are left in my daily calorie budget. It also allows me to see how my overall week has been thus far by showing me how many calories I am below budget for the whole week, which tells me if I have a little wiggle room to go over my budget today or not. To get to this screen, I open the app which gos right to the daily log with my detailed food entries, then I click the \"My Day\" icon on the bottom left of the screen to reach this daily overview screen. Once I'm here, I can view most of the info I want directly on this screen, but I can also scroll to the right along those icons at the top to see which daily tasks remain for me to complete if I'm interested in more than just the daily intake overview.", "I use this screen to check for bad weather coming through my area. Sometimes I want to just check for rain if I am anticipating being outside or having an outdoor event. It is especially helpful when there is unusually bad weather, such as tornadoes. To get to this screen on the app, I just have to click on the \"Radar\" tab, which is located on the footer menu of the app. Once on the screen, I need to put in the area that I am wanting information about into the search field at the top. Once I have entered the appropriate city and state, it will show a localized map. I can zoom in or out according to my preference. Next I can tap on the arrow to see a video of past, present, and future radar of weather coming through that area. If I need to pause, I can do that or I can rewatch it again as many times as I need to.", "I use Cronomoter, and specifically this screen, to track my food and exercise each day. It helps me to stay on track with my eating and exercise goals. The part on top is showing my calorie and macronutrient breakdown, and targets, for the day. For example, today I want to eat about 2100 calories, 133 grams of protein, 213 grams of carbs, and 83 grams of fat. Hitting these targets helps me with my ultimate goal of being healthy and hopefully building some muscle. To get to this screen I opened the app and tapped on the Diary picture in the bottom left. Then I swiped to the left in the top section, in order to get it to show the calorie and macronutrient breakdown. To use and interact with this screen I tap the Plus Sign at the bottom, which brings up another menu where I can manually search for and add a food I've eaten or scan the barcode on the packaging. Once I've selected the food I can add the amount. For example, 98 grams of banana. I can also search through different exercises to add one that I've done. It's still early, so I haven't eaten or done much today, which is why the entry is still fairly short.", "I like to play simple games on my phone. One of my favorites is Sudoku because it's relaxing and challenging at the same time. I like this particular Sudoku app because it has a very clean interface and not a lot of ads that interfere with my concentration while playing. To access this app I just click on the icon that I have saved to my homescreen on my Android phone. I definitely use this app a lot, but I'm not sure that I have a specific goal in mind when I use it. I suppose I like to challenge myself and take satisfaction every time I can complete a puzzle, especially when I can do it in as little amount of time as possible. It's a great distraction I'm in line somewhere and it's also fun to do while I'm relaxing at home. Pretty much this screen is the entire functionality of the app.", "My goal is to find music I love. I search through my favorite genres, usually pop, hip hop, alternative, and rock. I will want to search for music and create my own collection of music by clicking add to the collection. I will then be able to click my collection in the future and listen to all the songs that I love. My thoughts about using this app is that it allows me to find new artists and ones that I already know about. I can listen to music whenever I want to through this app and I can relax and get some cleaning done while listening. I also love the feature of it showing me the lyrics so I can really get to learn the songs and what they are saying in the songs. I would also use the search feature to find the songs that I have been listening often.", "When I open this app I go to this page and can update my profile. I can see how much progress I have made. I will then look at some of the plans that are available and if nothing interests me I can choose my own. I will typically go to the goals section and update or adjust any goals I want to achieve. I can set my reminders and nutrition information from this page. I can go to this page to check the steps I take daily. This is where I would also update my friends list and can interact with others through community. Over all this is the main place to make any changes and to see all things in an overall hub type place so that it is all easily accessible. I can make all of my inputs from here and also learn more about each section.", "So this is an open source client for reddit.com. I don't usually have a specific goal when using the app - I'm just browsing popular stories, images and discussions of the day from reddit. The app has a menu on the left side where you can browse the /r/all page (popular submissions), the home page (which is tailored by your interests), and specific subreddit communities. Basically on this page, I'll just be scrolling through, looking for something amusing, or interesting to see more information about. It might be a gif of a cat doing something stupid, a news article about the government doing something stupid, a discussion about users of reddit doing something stupid. Any number of stupid things can be found. \r\n\r\nI like the app because it's open source, ad-free, easy to use and free of clutter. I don't actually get it from the play store link above, I use an open source package manager called F-Droid. ", "The GetUpside app is used to get cash back on groceries, gas, and restaurants.  This screen shows a local grocery store where I could get cash back by claiming this offer and uploading a receipt within 24 hours.  In order to get to this screen I simply click on the store that I will be going to, there are many different stores/restaurants/gas stations that all have different offers for cash back.  So for instance another Cub Foods in a different location may have 10% cash back and another one may only have 5% cash back.  After I find the offer that I want to use I simply click on it and then click on claim offer.  As I said earlier at this point I have 24 hours to submit a picture of my receipt from my purchase on the app and I will usually get the cash back in my account with three or four days.  I usually cash out once I get about $15 dollars as there is no fee on withdrawals over that amount.  The money usually hits my PayPal account the next day. ", "I love this app because I get to use it to bring to life pictures I animate these pictures and I have found that. To make a new animated picture I open the app this is the first screen I see I select what kind of animation I want to do and then I get started by adding effects to my picture I add filters I change the colors I can Animate anything in alight motion picture simply by drawing a path. I add  real camera moving effects and dope photo transitions to your pics and video, I love the fact I can add already made animations to my photo and there are a lot ways that I use this app to make my pictures come to life, I then select what quality and length of the video output I want and then I upload it to YouTube and TikTok I love it because I can express Myself threw this app and it's easy.", "This feature is the Chipotle restaurant rewards that are given through redeeming points by eating at the restaurant and accumulating the points over time. The first step is to find the icon at the top left-hand corner of the screen shown as a human with rays around the head, then proceed to click this. After you will see in the middle of the screen an option that says, “My Rewards.” Where it will display the rewards, you currently have redeemable for use. Click the reward and add it to your “bag” so that it can be scanned or redeemed on your next purchase for free stuff! My goal on this screen to get more bang for my buck and get free offerings by eating a really good restaurant I enjoy- Chipotle. The feature works as a sort of cashback scheme in which I can earn more by eating there more. ", "The screen is mainly how I get to the scheduling of the lightbulbs I have connected to the app along with the simpler 'tap to run' where I can just click it to turn on/off when needed. Getting to the screen is easy, down at the bottom where it says home/scene/etc you start on the \"home\" screen when you open the app. From there I simply clicked on 'scene' and it brings me to this page. From there I'm able to change the different scenes I have enabled or create new ones -- things like turning on the lights every night at a certain time and determining what percentage I want them at (higher for reading, lower for watching television, etc). I can even change the color of the lights which we like to do at night when we watch tv so that it leaves a slight glow (red or really dark blue) and it isn't completely pitch black.", "I am a gambler so this screen is one of the keys to how i do my research. If I want to focus on hockey then I open up the flashscore app. I scroll to the games that are being played today after clicking the hockey button. It has all the different leagues in the world so I would click nhl. Say I am betting on red wings vs devils today as highlighted by the screen. Once I am on the page, it gives me an idea of their overall strengths and weaknesses. I can see the Red Wings are a little better than the Devils but Devils have the slightly better offense. I can expand the page to see just the last 5 games. In this case both teams are struggling so it is a game I might want to avoid. The top of the screenshot also has tabs so i can break it down by home/road and see which players in particular are in great form. Im not beating any books by doing this but it is a useful tool in my research.", "The Merlin Bird ID app is a application that lets you ID birds based on information that you provide. This screen allows you to enter (or edit) bits of information to the app that help the app come up with suggestions for what bird you may have seen. On this screen, I have entered the geographical location where I saw the bird, what size it is, the coloring, and whether I saw it flying, in the water, at a bird feeder, etc. The app the generates a list of best possible matches based on the information I just provided. Then, I scrolled down the list and selected the actual bird that I saw. I have a lot of birds in my back yard that come to my feeder and hand around in my trees, so this app is useful for identifying what they are and keeping track of what types of birds I have seen in my yard.", "I use this app and this screen to enter daily fantasy sports contests for different NBA games. The screen changes in response to the filling of contests and the completions of different games or slates of games, and I choose the contests that I want to enter as I use the app. I also can fill out my lineups when entering the contest. I get to the screen by choosing NBA on the home screen, then hitting Classic to show my preference for the type of contests I want to enter, and then choosing a slate, which in this case is tonight's 7:00 slate. Now that I am at the screen I can scroll down and choose which contests I want to enter. If I have money in my account, then I can easily click a contest, then fill out a lineup and submit it and I will be entered. If I already have filled out a lineup, I can simply enter that one as I enter the contest. ", "The main task is to calculate the data from my daily activity that from day starts and till the end of my day it just keep tracking the data of my health and activity and we need to add some data like our weight and height and some other data need to be provided inorder calculate a target and gives a goal of total activity that we need to do per day by then it gives us some award like things within the app if we do the given target goal each day and it also tracks the sleep track and gives us the data to analysis and then the app gives some rating and saves that data in the cloud from there we can check the data of almost one year back 's data and can analyze the data and if we add some more details like our health conditions it saves and it emergency condition the doctors can have access to the data even if we are in danger state"]